src/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоциальнаяСеть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КороткийАдрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Координаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексОтзывы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/КонтактнаяИнформацияКлиентСервер/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Функция получает представление значения контактной информации на форме
//
// Параметры:
//  Форма	 - УправляемаяФорма	 - форма-владелец контактной информации
//  Вид		 - СправочникСсылка.ВидыКонтактнойИнформации	 - вид для которого получается значение
// 
// Возвращаемое значение:
//  Строка - введенное на форме значение контактной информации
//
Функция ПолучитьЗначениеКонтактнойИнформации(Форма, Вид) Экспорт
	
	Отбор = Новый Структура("Вид", Вид);
	НайденныеСтроки = Форма.КонтактнаяИнформация.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат НайденныеСтроки[0].Представление;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Функция - Имена полей ввода контактной информации. 
// Может применятся для вывода сообщений об ошибке рядом с полем контактной информации.
//
// Параметры:
//  Форма	 - УправляемаяФорма	 - форма-владелец контактной информации
//  Вид		 - СправочникСсылка.ВидыКонтактнойИнформации	 - вид для которого получаются имена полей
// 
// Возвращаемое значение:
//  Массив - массив строк с именами полей ввода
//
Функция ИменаПолейВводаКонтактнойИнформации(Форма, Вид) Экспорт
	
	Результат = Новый Массив;
	
	Отбор = Новый Структура("Вид", Вид);
	НайденныеСтроки = Форма.КонтактнаяИнформация.НайтиСтроки(Отбор);
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		
		Индекс = Форма.КонтактнаяИнформация.Индекс(НайденнаяСтрока);
		ИмяЭлемента = "ПредставлениеКИ_"+Индекс;
		Если Форма.Элементы.Найти(ИмяЭлемента) <> Неопределено Тогда
			Результат.Добавить(ИмяЭлемента);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция - Пути к данным полей контактной информации. 
// Может применятся для вывода сообщений об ошибке рядом с полем контактной информации.
//
// Параметры:
//  Форма	 - УправляемаяФорма	 - форма-владелец контактной информации
//  Вид		 - СправочникСсылка.ВидыКонтактнойИнформации	 - вид для которого получаются имена полей
// 
// Возвращаемое значение:
//  Массив - массив строк с путями к данным полей ввода
//
Функция ПутиКДаннымПолейКонтактнойИнформации(Форма, Вид) Экспорт
	
	Результат = Новый Массив;
	
	Отбор = Новый Структура("Вид", Вид);
	НайденныеСтроки = Форма.КонтактнаяИнформация.НайтиСтроки(Отбор);
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		
		Индекс = Форма.КонтактнаяИнформация.Индекс(НайденнаяСтрока);
		ПутьКПолю = "КонтактнаяИнформация["+Индекс+"].Представление";
		Результат.Добавить(ПутьКПолю);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция - Список видов для добавления контактной информации
//
// Параметры:
//  Форма	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СписокВидовДляДобавленияКонтактнойИнформации(Знач СвойстваВидовКонтактнойИнформации, Знач КонтактнаяИнформация) Экспорт
	
	СписокДоступныхВидов = Новый СписокЗначений;
	Отбор = Новый Структура("Вид");
	Для Каждого СтрокаТаблицы Из СвойстваВидовКонтактнойИнформации Цикл
		Отбор.Вид = СтрокаТаблицы.Вид;
		Если СтрокаТаблицы.РазрешитьВводНесколькихЗначений Или КонтактнаяИнформация.НайтиСтроки(Отбор).Количество() = 0 Тогда
			СписокДоступныхВидов.Добавить(СтрокаТаблицы.Вид, СтрокаТаблицы.ПредставлениеВида, , КартинкаДействияПоТипуКонтактнойИнформации(СтрокаТаблицы.Тип));
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокДоступныхВидов;
	
КонецФункции

// Процедура - Заполнить список выбора адресов
//
// Параметры:
//  Форма	 - 	 - 
//
Процедура ЗаполнитьСписокВыбораАдресов(Форма) Экспорт
	
	МассивАдресов = Новый Массив;
	Отбор = Новый Структура("Вид");
	
	Для Каждого СтрокаТаблицы Из Форма.КонтактнаяИнформация Цикл
		
		Если СтрокаТаблицы.Тип <> ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор.Вид = СтрокаТаблицы.Вид;
		НайденныеСтроки = Форма.СвойстваВидовКонтактнойИнформации.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ПустаяСтрока(СтрокаТаблицы.Представление)
			И МассивАдресов.Найти(СтрокаТаблицы.Представление) = Неопределено Тогда
			
			МассивАдресов.Добавить(СтрокаТаблицы.Представление);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из Форма.КонтактнаяИнформация Цикл
		
		Если СтрокаТаблицы.Тип <> ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор.Вид = СтрокаТаблицы.Вид;
		НайденныеСтроки = Форма.СвойстваВидовКонтактнойИнформации.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПолеПредставление = Форма.Элементы["ПредставлениеКИ_" + Форма.КонтактнаяИнформация.Индекс(СтрокаТаблицы)];
		ПолеПредставление.СписокВыбора.ЗагрузитьЗначения(МассивАдресов);
		
		ПолеПредставление.КнопкаВыпадающегоСписка = ПолеПредставление.СписокВыбора.Количество() > 0;
		
	КонецЦикла;
	
КонецПроцедуры

// Формирует структуру полей контактной информации типа Телефон или МобильныйТелефон по представлению телефона
//
// Параметры
//  Представление  - Строка - строковая информация с номером телефона
//
// Возвращаемое значение:
//   Структура   - сформированная структура
//
Функция ПреобразоватьНомерДляОтправкиSMS(Знач Номер, Знач РегиональныеНастройкиСЕ) Экспорт
	
	Результат = Новый Структура("НомерКорректен, НомерОтправки, СообщениеОбОшибке");
	
	// Очистка пользовательских разделителей
	ЗаменяемыеСимволы = "()- ";
	Для НомерСимвола = 1 По СтрДлина(ЗаменяемыеСимволы) Цикл
		Номер = СтрЗаменить(Номер, Сред(ЗаменяемыеСимволы, НомерСимвола, 1), "");
	КонецЦикла;
	
	Если ЗначениеЗаполнено(РегиональныеНастройкиСЕ.СтранаУчета) И РегиональныеНастройкиСЕ.Код = "643" Тогда 
		// Телефонный код России 7 (вызов внутри страны начинается на 8), коды сотовых операторов начинаются на 9.
		Если Лев(Номер, 2) = "89" Тогда
			Номер = Сред(Номер, 2);
		ИначеЕсли Лев(Номер, 3) = "+79" Тогда
			Номер = Сред(Номер, 3);
		Иначе
			Результат.НомерКорректен = Ложь;
			Результат.СообщениеОбОшибке = НСтр("ru='Российские номера телефонов должны начинаться на +7 (или 8)';en='Russian phone numbers should start at +7 or 8)'");
			Возврат Результат;
		КонецЕсли;
		
		// Телефонные номера России десятизначные
		Если СтрДлина(Номер) = 10
			И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Номер) Тогда
			
			Результат.НомерОтправки = "+7" + Номер;
			Результат.НомерКорректен = Истина;
		Иначе
			Результат.НомерКорректен = Ложь;
			Результат.СообщениеОбОшибке = НСтр("ru='Российские номера телефонов содержат 10 цифр';en='Russian numbers of phones contain 10 numbers'");
		КонецЕсли;
	Иначе 
		Результат.НомерКорректен 	= Истина;
		Результат.НомерОтправки 	= УправлениеКонтактнойИнформациейКлиентСерверСтоматология.ВернутьТелефонТолькоЦифрами(Номер);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция - Картинка действия по типу контактной информации
//
// Параметры:
//  ТипКИ	 - ПеречислениеСсылка.ТипыКонтактнойИнформации	 - тип для которого получается картинка
// 
// Возвращаемое значение:
//  Картинка - пиктограмма для отображения
//
Функция КартинкаДействияПоТипуКонтактнойИнформации(ТипКИ) Экспорт
	
	Если ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") Тогда
		КартинкаДействия = БиблиотекаКартинок.КонтактнаяИнформацияТелефон;
	ИначеЕсли ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты") Тогда
		КартинкаДействия = БиблиотекаКартинок.КонтактнаяИнформацияЕмэйл;
	ИначеЕсли ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
		КартинкаДействия = БиблиотекаКартинок.КонтактнаяИнформацияАдрес;
	ИначеЕсли ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Факс") Тогда
		КартинкаДействия = БиблиотекаКартинок.КонтактнаяИнформацияФакс;
	ИначеЕсли ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.СоциальнаяСеть") Тогда
		КартинкаДействия = БиблиотекаКартинок.КонтактнаяИнформацияСоциальнаяСеть;
    ИначеЕсли ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Skype") Тогда
		КартинкаДействия = БиблиотекаКартинок.КонтактнаяИнформацияСкайп;
	Иначе
		КартинкаДействия = Новый Картинка;
	КонецЕсли;
	
	Возврат КартинкаДействия;
	
КонецФункции

#КонецОбласти
